//package ex3;
//
//public class Ex01 {
//	ex3 
//	Ex01. 주석으로 작성
//	   1) 메소드 오버로딩과 메소드 오버라이딩 차이점
//		
//	   2) 객체 지향 프로그래밍의 특징
//		다향성,캡슐화
//		
//	   3) 접근제한자의 역할과 차이점
//		default : 
//		public : 패키지안에서 접근가능함 패키지 외부에서는 임포트 해야함
//		protected : 
//		private : 어떤 접근도 불가 게터 세터 로 접근가능
//	   4) 상속이란 무엇인지 설명하고, 자바에서 상속을 구현하는 방법 작성
//		상속이란 자식클래스에서 부모클래스 로 부터 상속받아 부모클래스에 메소드를 따로 작성하지않고 사용할수있다 
//		
//	
//	   5) 익명클래스는 언제 사용되는지와 어떻게 구현되는지 서술
//	
//	   6) 추상클래스란 무엇인지와 사용하는 이유는 무엇인지 서술
//	
//	   7) 인터페이스의 개념과 특징
//	
//
//}